// 给你一个正整数 n ，开始时，它放在桌面上。在 10⁹ 天内，每天都要执行下述步骤：
//
//
//  对于出现在桌面上的每个数字 x ，找出符合 1 <= i <= n 且满足 x % i == 1
//  的所有数字 i 。 然后，将这些数字放在桌面上。
//
//
//  返回在 10⁹ 天之后，出现在桌面上的 不同 整数的数目。
//
//  注意：
//
//
//  一旦数字放在桌面上，则会一直保留直到结束。
//  % 表示取余运算。例如，14 % 3 等于 2 。
//
//
//
//
//  示例 1：
//
//
// 输入：n = 5
// 输出：4
// 解释：最开始，5 在桌面上。
// 第二天，2 和 4 也出现在桌面上，因为 5 % 2 == 1 且 5 % 4 == 1 。
// 再过一天 3 也出现在桌面上，因为 4 % 3 == 1 。
// 在十亿天结束时，桌面上的不同数字有 2 、3 、4 、5 。
//
//
//  示例 2：
//
//
// 输入：n = 3
// 输出：2
// 解释：
// 因为 3 % 2 == 1 ，2 也出现在桌面上。
// 在十亿天结束时，桌面上的不同数字只有两个：2 和 3 。
//
//
//
//
//  提示：
//
//
//  1 <= n <= 100
//
//
//  Related Topics 数组 哈希表 数学 模拟 👍 17 👎 0

#include <bits/stdc++.h>
using namespace std;

// leetcode submit region begin(Prohibit modification and deletion)
class Solution {
public:
  int distinctIntegers(int n) {
    unordered_set<int> pool{};
    pool.insert(n);
    queue<int> q;
    q.emplace(n);
    while (!q.empty()) {
      auto cur = q.front();
      for (int i = 2; i <= n; ++i)
        if (pool.count(i) == 0 && ((cur - 1) % i == 0))
          pool.insert(i), q.push(i);
      q.pop();
    }
    return pool.size();
  }
};
// leetcode submit region end(Prohibit modification and deletion)
