// 给你一个下标从 0 开始的整数数组 nums
// ，它表示英雄的能力值。如果我们选出一部分英雄，这组英雄的 力量 定义为：
//
//
//  i0 ，i1 ，... ik 表示这组英雄在数组中的下标。那么这组英雄的力量为
//  max(nums[i0],nums[i1] ... nums[ik])²
//* min(nums[i0],nums[i1] ... nums[ik]) 。
//
//
//  请你返回所有可能的 非空 英雄组的 力量 之和。由于答案可能非常大，请你将结果对
//  109 + 7 取余。
//
//
//
//  示例 1：
//
//
// 输入：nums = [2,1,4]
// 输出：141
// 解释：
// 第 1 组：[2] 的力量为 2² * 2 = 8 。
// 第 2 组：[1] 的力量为 1² * 1 = 1 。
// 第 3 组：[4] 的力量为 4² * 4 = 64 。
// 第 4 组：[2,1] 的力量为 2² * 1 = 4 。
// 第 5 组：[2,4] 的力量为 4² * 2 = 32 。
// 第 6 组：[1,4] 的力量为 4² * 1 = 16 。
// 第​ ​​​​​​7 组：[2,1,4] 的力量为 4²​​​​​​​ * 1
// = 16 。 所有英雄组的力量之和为 8 + 1 + 64 + 4 + 32 + 16 + 16 = 141 。
//
//
//  示例 2：
//
//
// 输入：nums = [1,1,1]
// 输出：7
// 解释：总共有 7 个英雄组，每一组的力量都是 1 。所以所有英雄组的力量之和为 7 。
//
//
//
//
//  提示：
//
//
//  1 <= nums.length <= 10⁵
//  1 <= nums[i] <= 10⁹
//
//
//  Related Topics 数组 数学 前缀和 排序 👍 88 👎 0

#include <bits/stdc++.h>
using u64 = std::uint64_t;
using i8 = std::int8_t;
using u8 = std::uint8_t;
// leetcode submit region begin(Prohibit modification and deletion)
using std::vector;
constexpr int MOD = 1e9 + 7;
class Solution {
public:
  int sumOfPower(vector<int> &nums) {
    std::sort(nums.begin(), nums.end());
    auto const n = nums.size();
    using i64 = std::int64_t;
    i64 prefix = 0, ans = 0;
    for (int i = 0; i < n; ++i) {
      auto t = i64(nums[i]) * nums[i] % MOD;
      ans += t * nums[i] % MOD;
      ans %= MOD;
    }
    for (int i = 0; i < n; ++i) {
      ans += (i64(nums[i]) * nums[i] % MOD) * prefix % MOD;
      ans %= MOD;
      prefix *= 2;
      prefix += nums[i];
      prefix %= MOD;
    }
    return ans;
  }
};
// leetcode submit region end(Prohibit modification and deletion)
