//在由 1 x 1 方格组成的 n x n 网格 grid 中，每个 1 x 1 方块由 '/'、'\' 或空格构成。这些字符会将方块划分为一些共边的区域。 
//
//
// 给定网格 grid 表示为一个字符串数组，返回 区域的数量 。 
//
// 请注意，反斜杠字符是转义的，因此 '\' 用 '\\' 表示。 
//
// 
//
// 
// 
//
// 示例 1： 
//
// 
//
// 
//输入：grid = [" /","/ "]
//输出：2 
//
// 示例 2： 
//
// 
//
// 
//输入：grid = [" /","  "]
//输出：1
// 
//
// 示例 3： 
//
// 
//
// 
//输入：grid = ["/\\","\\/"]
//输出：5
//解释：回想一下，因为 \ 字符是转义的，所以 "/\\" 表示 /\，而 "\\/" 表示 \/。
// 
//
// 
//
// 提示： 
//
// 
// n == grid.length == grid[i].length 
// 1 <= n <= 30 
// grid[i][j] 是 '/'、'\'、或 ' ' 
// 
//
// Related Topics 深度优先搜索 广度优先搜索 并查集 图 👍 343 👎 0


#include <bits/stdc++.h>
using let = std::any;
using u64 = std::uint64_t;
using i64 = std::int64_t;
using i8 = std::int8_t;
//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
public:
    int regionsBySlashes(vector<string>& grid) {

    }
};
//leetcode submit region end(Prohibit modification and deletion)




